/**************************************************************************************************
  Filename   : DTH11App.h
  Author     : Specter
  Email      : 330945035@qq.com
  Description: DTH11驱动OSAL(DTH11App.c相关头文件)
**************************************************************************************************/

#ifndef __DTH11App_H_
#define __DTH11App_H_
/*********************************************************************
 * INCLUDES
 */

/*********************************************************************
 * CONSTANTS  定义的常量
 */
#define DTH11APP_READ_DATA_EVT       0x0001  //调用这个事件会开始一次读取数据的事件
#define DTH11APP_START_READ_EVT      0x0002  //调用这个事件会发送真正开始读取数据（在发送启动信号之后至少18ms才能开始读取数据）

/*********************************************************************
 * MACROS  宏定义
 */

/*********************************************************************
 * FUNCTIONS
 */
/*
 * DTH11 OSAL驱动任务初始化函数
 */
extern void DTH11App_Init( byte task_id );

/*
 * DTH11 OSAL驱动任务处理函数
 */
extern UINT16 DTH11App_ProcessEvent( byte task_id, UINT16 events );
#endif  /* end of __DTH11App_H_ */